{
  "basics": {
    "name": "Erik Escobedo",
    "label": "Software Engineer",
    "image": "https://erik.escobedo.dev/resume.jpg",
    "email": "erik@escobedo.dev",
    "phone": "+52 (999) 969-3090",
    "url": "https://erik.escobedo.dev",
    "summary": "I'm a hands-on software architect and full-stack engineer with 16+ years of experience, including 3 years at Google Classroom. I specialize in managing technical debt and transforming legacy complexity into maintainable architecture. I have more than a decade of remote-first experience, bridging the gap between business goals and technical execution, ensuring reliability and performance in every project I'm involved in.",
    "location": {
      "address": "103A Calle 13 San Juan II",
      "postalCode": "97350",
      "city": "Hunucma",
      "countryCode": "MX",
      "region": "Yucatan"
    },
    "profiles": [
      {
        "network": "Github",
        "username": "escoberik",
        "url": "https://github.com/escoberik"
      },
      {
        "network": "Toptal",
        "username": "erik-escobedo",
        "url": "https://www.toptal.com/developers/resume/erik-escobedo"
      }
    ]
  },
  "work": [
    {
      "name": "Google",
      "position": "Software Engineer",
      "url": "https://edu.google.com",
      "startDate": "2023-01-16",
      "endDate": "2026-02-09",
      "summary": "Google Classroom is a learning management platform serving millions of users worldwide. I was involved in maintaining the Classroom API infrastructure, focusing on large-scale migrations and the strategic sunsetting of legacy systems.",
      "highlights": [
        "Designed and implemented the database migration for the Google Classroom API: Registrations service, using a Dark Launch approach to validate data for millions of users.",
        "Architected a synthetic SIS sandbox to facilitate integration testing and AI agent crawling, fed by Google Spreadsheets as a flexible data source for two-way verification across OneRoster 1.1 and 1.2 protocols.",
        "Mentored junior engineers on software engineering best practices, guiding them through complex system designs, Google’s rigorous code review standards, and career development paths.",
        "Led the End-of-Life (EOL) process for a legacy platform, coordinating phased account closures and resolving critical data conflicts to ensure a smooth transition for clients before final decommissioning.",
        "Co-architected a comprehensive test coverage suite for legacy pipelines using SQLT to ensure reliability during system integration of an acquired third party."
      ]
    }
  ]
}
